{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "arguments": {}, "batch_input_shape": [null, 80, 160, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa;/home/levin/workspace/carnd/behavioural-cloning-p3/model.py\u00da\b<lambda>\u0015\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_1", "trainable": true, "output_shape": [80, 160, 3], "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "subsample": [2, 2], "name": "convolution2d_1", "trainable": true, "W_regularizer": null, "nb_filter": 24, "nb_col": 5, "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_1", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "subsample": [2, 2], "name": "convolution2d_2", "trainable": true, "W_regularizer": null, "nb_filter": 36, "nb_col": 5, "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_2", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 5, "subsample": [2, 2], "name": "convolution2d_3", "trainable": true, "W_regularizer": null, "nb_filter": 48, "nb_col": 5, "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_3", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.1, "name": "spatialdropout2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_4", "trainable": true, "W_regularizer": null, "nb_filter": 64, "nb_col": 3, "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_4", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "dim_ordering": "tf", "nb_row": 3, "subsample": [1, 1], "name": "convolution2d_5", "trainable": true, "W_regularizer": null, "nb_filter": 64, "nb_col": 3, "bias": true, "activity_regularizer": null, "border_mode": "valid", "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_5", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "SpatialDropout2D", "config": {"p": 0.1, "name": "spatialdropout2d_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_1", "trainable": true, "input_dim": 2496, "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 1164, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_6", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_6", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_2", "trainable": true, "input_dim": 1164, "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 100, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_7", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_3", "trainable": true, "input_dim": 100, "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 50, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_8", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_8", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_4", "trainable": true, "input_dim": 50, "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 10, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "axis": -1, "mode": 0, "gamma_regularizer": null, "name": "batchnormalization_9", "trainable": true, "momentum": 0.99, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_9", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.1, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_5", "trainable": true, "input_dim": 10, "W_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 1, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null}}]}